1. import pandas

In [1]:
import pandas as pd
import numpy as np

2.1 create a data frame, name it df, and load the the data in mls_salaries.csv to it.

In [2]:
df = pd.read_csv('mls_salaries.csv')

2.2 explore your data using head(), tail(), describe() and info()

In [3]:
df.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

In [4]:
df.tail()

    club last_name first_name position  base_salary  guaranteed_compensation
610  VAN   Teibert    Russell        M     126500.0                 194000.0
611  VAN  Tornaghi      Paolo       GK      80000.0                  80000.0
612  VAN    Waston    Kendall        D     350000.0                 368125.0
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                 184000.0

In [5]:
df.describe()

        base_salary  guaranteed_compensation
count  6.140000e+02             6.140000e+02
mean   2.971730e+05             3.263752e+05
std    6.725839e+05             7.491217e+05
min    5.299992e+04             5.299992e+04
25%    6.563340e+04             7.003035e+04
50%    1.250000e+05             1.350020e+05
75%    2.550000e+05             2.798750e+05
max    6.660000e+06             7.167500e+06

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 615 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 29.0+ KB

3.1  display only the first_name column

In [7]:
df['first_name']

0       Miguel
1        Mikey
2        Yamil
3         Mark
4       Andrew
        ...
610    Russell
611      Paolo
612    Kendall
613        NaN
614    Sheanon
Name: first_name, Length: 615, dtype: object

3.2 display only the first_name ,position and last name columns

In [8]:
df[['first_name', 'position', 'last_name']]

    first_name position last_name
0       Miguel        M   Almiron
1        Mikey        D   Ambrose
2        Yamil        M      Asad
3         Mark        D     Bloom
4       Andrew        F  Carleton
..         ...      ...       ...
610    Russell        M   Teibert
611      Paolo       GK  Tornaghi
612    Kendall        D    Waston
613        NaN      NaN       NaN
614    Sheanon        D  Williams

[615 rows x 3 columns]

4. add 1$ to base salary, make sure your changes are saved to the data frame

In [9]:
df['base_salary'] = df['base_salary'].add(1)

5. add a new column, name it "best team" use "super strikers" as the default value in that column

In [10]:
df.insert(0, column='best team', value='super strikers')

6. add a column in the 2nd position, name it "age" use NaN as default (this may be a little harder that you expect)

In [11]:
df.insert(1, column="age", value= np.nan)

7. how many types of clubs are there?

In [12]:
df['club'].nunique()

23

8. Which club is the most common?

In [13]:
df['club'].mode()

0    VAN
Name: club, dtype: object

9. If you have some time left, you can create a function that receives a float between 0 and 1 and prints the corresponding quantile with a sentence.
For example, if it receives the number 0.7, it should print: 'The 70.0% quantile salary is 225000.0.'

In [14]:
df['base_salary'].quantile(0.7)

np.float64(225001.0)

In [15]:
def quant_func(num):
    pct = num * 100
    print(f"The {pct}% quantile salary is {num}")

In [16]:
print(quant_func(df['base_salary'].quantile(0.7)))

The 22500100.0% quantile salary is 225001.0
None